{
  "termsOfService": {
    "title": "이용약관",
    "articles": [
      {
        "number": 1,
        "title": "제 1 조 목적",
        "content": "본 약관은 주식회사 OOO(이하 회사)가 운영하는 웹사이트(www.raonbnp.com)에서 제공하는 인터넷 관련 서비스(이하 '서비스'라 한다)를 이용함에 있어, 이용자와 회사간의 권리·의무 및 책임 사항, 이용 조건 및 절차 등에 관한 사항과 기타 필요한 사항을 규정함을 목적으로 합니다."
      },
      {
        "number": 2,
        "title": "제 2 조 정의",
        "content": "이 약관에서 사용하는 용어의 정의는 다음과 같습니다.",
        "definitions": [
          {
            "definition": "[이용자]라 함은 회사가 제공하는 인터넷 서비스에 접속하여 이 약관에 따라 회사가 제공하는 서비스를 받는 이용자 및 비이용자를 말합니다."
          },
          {
            "definition": "[운영자]란 서비스와 전반적 관리 및 운영을 담당하는 회사의 직원을 말합니다."
          }
        ]
      },
      {
        "number": 3,
        "title": "제 3 조 서비스 이용 계약의 성립",
        "content": "이용자는 회사가 정한 소정의 절차를 거쳐서 '동의'를 하면 본 약관에 동의하는 것으로 간주합니다.\n\n본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관해서는 전자상거래 등에서의 소비자 보호에 관한 법률약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상 관례에 따릅니다."
      },
      {
        "number": 4,
        "title": "제 4 조 정보 및 서비스의 제공 등",
        "content": [
          "1. 회사는 이용자들에게 다양한 내용의 컨텐츠를 서비스하며 이용자는 인터넷에 접속가능 사이트를 통해 회사에서 제공하는 서비스를 이용할 수 있습니다.",
          "2. 이용자는 회사에서 서비스하는 모든 내용에 대해 자유롭게 이용하고 활용할 수 있습니다.",
          "3. 회사가 제공하는 모든 서비스는 일정한 주기 없이 수시로 내용의 업데이트 또는 확장, 변경됩니다.",
          "4. 이용자는 회사가 제공하는 서비스의 내용에 대한 문제가 있다고 생각되거나 다른 의견에 대해서는 사이트 내의 게시판, 담당자에게 보내는 e-mail을 통해 자신의 의견을 게시할 수 있습니다.",
          "5. 이용자가 자유롭게 사이트 내의 게시판 등에 올린 내용에 대해서는 회사는 어떠한 경우도 그 내용에 대한 책임이 없습니다.",
          "6. 서비스 제공은 하루 24시간 제공을 원칙으로 하나 정기 점검이나 설비 보수, 전기통신사업법에 의한 기간통신사업자의 서비스 중단, 천재지변 등 불가항력적인 이유로 사전 고지 없이 정보제공을 중단할 수 있습니다."
        ]
      },
      {
        "number": 5,
        "title": "제 5 조 이용자 신상정보 관리 등 의무",
        "content": [
          "1. 회사는 서비스 제공을 위해 수집한 이용자 신상정보를 본인의 승낙 없이 제3자에게 배포, 제공하는 등 외부로 유출하지 않습니다.",
          "단, 적법한 절차를 거친 국가기관의 요구나 기타 공익을 위해 필요하다고 인정되는 경우는 예외로 합니다.",
          "2. 회사는 이용자가 회사가 제공하는 서비스를 원활하게 이용할 수 있도록 노력할 의무가 있으며, 이용자 신상정보 역시 이용자에 대한 서비스 향상을 위해서만 이용합니다.",
          "3. 개인정보 보호에 관해서는 관련법령 및 회사의 '개인정보 보호정책'에 준합니다."
        ]
      },
      {
        "number": 6,
        "title": "제 6 조 서비스 이용에 대한 이용자의 의무",
        "content": [
          "1. 이용자의 관리 소홀로 정보 노출과 이에 따른 피해는 전적으로 이용자가 책임지도록 합니다.",
          "2. 회사에서 제공하는 서비스에 대한 이용자의 이용권한은 이용자 개인에 한정된 것이며, 제3자에 양도나 대여할 경우 회사에서 임의로 해당 이용자의 정보를 삭제할 수 있습니다.",
          "특히 무단 양도나 대여에 대한 책임은 전적으로 이용자가 책임지도록 합니다.",
          "3. 이용자는 회사에서 제공하는 서비스를 이용할 때 다음 각 호를 해서는 안 됩니다.",
          "- 다른 사람의 E-mail address을 무단 사용하는 행위",
          "- 서비스 이용 중 습득한 정보를 상업적 목적으로 이용하거나 올린 이 또는 회사의 허가 없이 출판, 방송 등 제3자에게 노출시키는 행위.",
          "단, 공익을 목적으로 하거나 이용자의 권익 증진을 위해 필요한 경우 회사에 협의를 요청하고 허가를 받아야 한다.",
          "- 저작권 등 제3자의 권리를 침해하는 게시 행위.",
          "- 회사의 사이트 운영을 방해하는 행위",
          "- 사회 공공질서에 위배되거나 건전한 미풍양속을 저해하는 정보나 문자, 그림 등을 타인에게 유포하는 행위",
          "4. 이용자는 회사의 이용자에 대한 서비스 향상을 위한 노력에 성실히 협조해야 합니다."
        ]
      },
      {
        "number": 7,
        "title": "제 7 조 게시 및 저장 자료에 대한 책임과 권리",
        "content": [
          "1. 회사 사이트 내에 상용자료나 불법자료, 배포금지 자료는 절대 업로드 불가입니다.",
          "2. 이용자는 자신이 사이트 내에 게재한 소프트웨어, 프로그램, 정보, 메시지, 데이터, 문서, 그림, 이미지, 문자, 소리, 개인정보 등에 대해 책임이 있으며, 저작권 침해 등 기타 불법 행위로 인해 발생하는 피해에 대해서도 책임을 갖습니다.",
          "3. 회사는 사이트 내에 게시되거나 저장된 자료의 관리를 위해 성실히 노력합니다.",
          "4. 사이트 내에 저장 또는 게재된 모든 자료의 저작권은 해당 자료의 등록자에게 있으며, 외부에서 가져온 타인의 게시물 및 자료는 등록자의 저작권이 인정되지 않습니다.",
          "5. 이용자는 정당한 권한이나 해당 프로그램 저작권자의 허락 없이 프로그램 등을 제거, 변경, 복제하거나 게시, 전송, 링크, 배포할 수 없으며, 저작권자의 실명 또는 익명을 변경 또는 은닉하거나 해당 프로그램의 제호를 변경해 저작권자의 허가 없이 게시, 게재할 수 없습니다.",
          "6. 회사는 사이트 내에 저장 또는 게재된 모든 자료와 게시물을 자료를 게시한 이용자의 동의를 거쳐 출판, CD-ROM 제작 등에 사용할 수 있습니다."
        ]
      },
      {
        "number": 8,
        "title": "제 8 조 게시물의 관리",
        "content": [
          "회사는 다음 각 호에 해당하는 게시물이나 자료를 사전통지 없이 삭제하거나 이동 또는 등록 거부를 할 수 있습니다.",
          "1. 이용자가 사이트 서비스 이용 시 등록한 내용에 허위, 기재누락, 오기가 있는 경우",
          "2. 다른 이용자 또는 제 3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우",
          "3. 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우",
          "4. 불법복제 또는 해킹을 조장하는 내용인 경우",
          "5. 영리를 목적으로 하는 광고일 경우",
          "6. 범죄와 결부된다고 객관적으로 인정되는 내용일 경우",
          "7. 다른 이용자 또는 제 3자의 저작권 등 기타 권리를 침해하는 내용인 경우",
          "8. 사이트에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우",
          "9. 기타 관계법령에 위배된다고 판단되는 경우"
        ]
      },
      {
        "number": 9,
        "title": "제 9 조 면책 및 손해 배상",
        "sections": [
          {
            "subtitle": "[면책사항]",
            "content": [
              "1. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.",
              "2. 회사는 이용자의 귀책사유로 인한 서비스의 이용장애에 대하여 책임을 지지 않습니다.",
              "3. 회사는 이용자가 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며 서비스를 통하여 얻은 자료로 인한 손해 등에 대하여도 책임을 지지 않습니다. 회사는 이용자가 사이트에 게재한 정보, 자료, 사실의 신뢰도 및 정확성 등 내용에 대하여는 책임을 지지 않습니다.",
              "4. 회사는 이용자 상호간 또는 이용자와 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다."
            ]
          },
          {
            "subtitle": "[손해배상]",
            "content": [
              "1. 이용자가 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 본 약관을 위반한 이용자는 회사에 발생하는 모든 손해를 배상하여야 합니다.",
              "2. 이용자가 서비스를 이용함에 있어 행한 불법행위나 본 약관 위반행위로 인하여 회사가 당해 이용자 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 이용자는 자신의 책임과 비용으로 회사를 면책시켜야 하며, 당해 이용자는 그로 인하여 회사에 발생한 모든 손해를 배상하여야 합니다."
            ]
          }
        ]
      },
      {
        "number": 10,
        "title": "제 10 조 약관 규정 외 사항에 관한 준칙",
        "content": "현 약관에 규정되지 않은 사항에 대해서는 전기통신사업법 등 관계 법령의 규정을 따릅니다."
      },
      {
        "number": 11,
        "title": "제 11 조 관할 법원",
        "content": "서비스 이용 중 이용자와 회사 간에 분쟁이 발생, 소송이 제기될 경우 회사의 소재지 관할 법원을 관할 법원으로 합니다."
      }
    ],
    "appendix": {
      "title": "부칙",
      "content": "이 규정은 2021년 2월 1일부터 시행합니다."
    }
  }
}
